#include <stdio.h>

int main(void)
{
	//다차원 배열 Multidimensional Array

	int i;
	//0

	int arr[5];
	//00000
	//[0][1][2][3][4]



	//2차원 배열
	int arr2[2][5];
	//00000
	//00000
	//[0,0][0,1][0,2][0,3][0,4] -> arr2[0][0]으로 사용
	//[1,0][1,1][1,2][1,3][1,4]

	int arr3[4][2];
	//00
	//00
	//00
	//00

	//3차원 배열
	int arr4[3][3][3];
	//000
	//000
	//000

	//000
	//000
	//000

	//000
	//000
	//000

	int array[5] = { 1,2,3,4,5 };

	int array2[2][5] = { 
		{ 1, 2, 3, 4, 5 }, 
		{ 1, 2, 3, 4, 5 } 
	};
	for (int i = 0; i < 2; i++)
	{
		for (int j = 0; j < 5; j++)
		{
			printf("2차원 배열 (%d,%d)의 값: %d\n", i, j, array2[i][j]);
		}
		printf("\n");

	}

	//3차원 배열
	int array3[3][3][2] = { 
		{ 
			{ 1, 2 }, 
			{ 1, 2 }, 
			{ 1, 2 } 
		}, 
		{ 
			{ 1, 2 }, 
			{ 1, 2 }, 
			{ 1, 2 } 
		}, 
		{ 
			{ 1, 2 }, 
			{ 1, 2 }, 
			{ 1, 2 } 
		} 
	};


	for (int i = 0; i < 3; i++)
	{
		for (int j = 0; j < 3; j++)
		{
			for (int k = 0; k < 2; k++)
			{
				printf("3차원 배열 (%d,%d,%d)의 값: %d\n", i, j, k, array3[i][j][k]);
			}
			printf("\n");
		}
		printf("\n");

	}


	return 0;
}